Revit 2027 API
ExternalDataManagerCommand(ExternalDataManagerCommandId) Constructor
 Constructor
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalDataManagerCommand(
	ExternalDataManagerCommandId id
)
Public Sub New (
	id As ExternalDataManagerCommandId
)
public:
ExternalDataManagerCommand(
	ExternalDataManagerCommandId^ id
)
new :
        id : ExternalDataManagerCommandId -> ExternalDataManagerCommand
Parameters
id ExternalDataManagerCommandId
 The id of the command.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalDataManagerCommand Class
ExternalDataManagerCommand Overload
Autodesk.Revit.UI Namespace